I think @justinretzolk  already answered the reason. I am putting an example here.

Here is simple directory structure. Assume there are two modules `alarm` and `cw` and a `terrform.tf` in the root module (just keeping one simple file).

```
.
├── alarm
│   ├── main.tf
│   └── versions.tf
├── cw
│   ├── main.tf
│   └── versions.tf
└── terraform.tf

```
 cw/main.tf
 
 
 ```hcl
 variable "name_prefix" {
  type = string
}

data "aws_region" "current" {}

resource "aws_cloudwatch_log_group" "this" {
  name = "${var.name_prefix}/application/sample-${data.aws_region.current.name}" # depends on data resource
}
```

cw/versions.tf is 

```hcl
terraform {
  required_version = ">= 1.0"
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = ">= 5.0"
    }
  }
}
```


terraform.tf

```hcl
terraform {
  required_version = "~> 1.8.0"

  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 5.47"
    }
  }

  backend "s3" {
    region         = "eu-north-1"
    bucket         = "terraform-state-blah-eu-north-1"
    key            = "mock-test.tfstate"
    profile        = "aws-dev"
    dynamodb_table = "terraform-state-lock"
  }
}

provider "aws" {
  region  = "eu-north-1"
  profile = "aws-dev"
}

module "alarm" {
  source = "./alarm"
}


# NOTE: I am calling same module twice once without depends on and once with depends on

module "cw_without_depends_on" {
  source = "./cw"
  name_prefix = "without-depends-on"
}

module "cw_with_depends_on" {
  source = "./cw"
  name_prefix = "with-depends-on"

  depends_on = [module.alarm]  <------- See this
}

```

For this following plan is generated.


```hcl
  # module.cw_with_depends_on.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply) <--- due to depends_on
    }

  # module.cw_with_depends_on.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply) <--- name NOT resolved, due to aws_region resolution is deffered
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.cw_without_depends_on.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "without-depends-on/application/sample-eu-north-1" <--- name resolved.
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

```

data resource `aws_region` resolution is deferred, if we introduce `depends_on` on the module.
similar behaviour will happen for `for_each `and `count`


Hope this helps.
